Revit 2026 API

# CylindricalSurfaceGetFrameOfReference Method

---

Returns frame of reference associated with this CylindricalSurface.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Frame GetFrameOfReference()
```
```vb
Public Function GetFrameOfReference As Frame
```
```cpp
public:
Frame^ GetFrameOfReference()
```
```fsharp
member GetFrameOfReference : unit -> Frame
```

#### Return Value

Frame Frame of reference associated with this CylindricalSurface.

This is an equivalent of new Frame(Origin, XDir, YDir, Axis).

#### Reference

CylindricalSurface Class

Autodesk.Revit.DB Namespace